### Terraform Initialization `success`

### Terraform Validation `success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

### Terraform Plan `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
  + create
  - destroy

Terraform will perform the following actions:

  # module.dev-net-firewall-policy.google_compute_firewall_policy_rule.hierarchical["ingress/in-inspect-app-svc"] will be created
  + resource "google_compute_firewall_policy_rule" "hierarchical" {
      + action                 = "apply_security_profile_group"
      + creation_timestamp     = (known after apply)
      + description            = "Inspect App project - Svc project"
      + direction              = "INGRESS"
      + disabled               = false
      + firewall_policy        = "896163021144"
      + id                     = (known after apply)
      + kind                   = (known after apply)
      + priority               = 4201
      + rule_tuple_count       = (known after apply)
      + security_profile_group = "//networksecurity.googleapis.com/organizations/872410903863/locations/global/securityProfileGroups/nspg-threatprevention-group"

      + match {
          + dest_ip_ranges = [
              + "10.3.12.0/24",
            ]
          + src_ip_ranges  = [
              + "10.3.22.0/24",
            ]

          + layer4_configs {
              + ip_protocol = "tcp"
              + ports       = []
            }
        }
    }

  # module.firewall-policy.google_compute_firewall_policy.hierarchical[0] will be destroyed
  # (because google_compute_firewall_policy.hierarchical is not in configuration)
  - resource "google_compute_firewall_policy" "hierarchical" {
      - creation_timestamp = "2025-09-24T09:00:19.408-07:00" -> null
      - fingerprint        = "CCmzp_pWgWY=" -> null
      - firewall_policy_id = "331557554235" -> null
      - id                 = "locations/global/firewallPolicies/331557554235" -> null
      - name               = "331557554235" -> null
      - parent             = "organizations/872410903863" -> null
      - rule_tuple_count   = 8 -> null
      - self_link          = "https://www.googleapis.com/compute/v1/locations/global/firewallPolicies/331557554235" -> null
      - self_link_with_id  = "https://www.googleapis.com/compute/v1/locations/global/firewallPolicies/331557554235/331557554235" -> null
      - short_name         = "fw-dev-app-svc-policy" -> null
        # (1 unchanged attribute hidden)
    }

  # module.firewall-policy.google_compute_firewall_policy_rule.hierarchical["ingress/in-inspect-app-svc"] will be destroyed
  # (because google_compute_firewall_policy_rule.hierarchical is not in configuration)
  - resource "google_compute_firewall_policy_rule" "hierarchical" {
      - action                 = "apply_security_profile_group" -> null
      - description            = "Inspect App project - Svc project" -> null
      - direction              = "INGRESS" -> null
      - disabled               = false -> null
      - enable_logging         = false -> null
      - firewall_policy        = "331557554235" -> null
      - id                     = "locations/global/firewallPolicies/331557554235/rules/4201" -> null
      - kind                   = "compute#firewallPolicyRule" -> null
      - priority               = 4201 -> null
      - rule_tuple_count       = 3 -> null
      - security_profile_group = "//networksecurity.googleapis.com/organizations/872410903863/locations/global/securityProfileGroups/nspg-threatprevention-group" -> null
      - tls_inspect            = false -> null
        # (1 unchanged attribute hidden)

      - match {
          - dest_ip_ranges = [
              - "10.3.12.0/24",
            ] -> null
          - src_ip_ranges  = [
              - "10.3.22.0/24",
            ] -> null

          - layer4_configs {
              - ip_protocol = "tcp" -> null
              - ports       = [] -> null
            }
        }
    }

Plan: 1 to add, 0 to change, 2 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "universe" but a value was

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Value for undeclared variable

The root module does not declare a variable named "service_accounts" but a

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Values for undeclared variables

In addition to the other similar warnings shown, 6 other variable(s) defined


Saved the plan to: ../plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "../plan.out"
```

</details>

### Terraform Apply `success`

*Pusher: @leorocca-gg, Action: `pull_request`, Working Directory: ``, Workflow: `FAST networking stage`*